<center><img src='https://raw.githubusercontent.com/Jangrae/img/master/title.png' width=500/></center>

<center><img src='https://raw.githubusercontent.com/Jangrae/img/master/practice.png' width=300/></center>

# 실습 목표

- CSV 파일에서 데이터를 읽어올 수 있습니다.
- 조건에 맞는 데이터를 조회할 수 있습니다.

# P2. [실습] 데이터프레임 조회

In [1]:
# 라이브러리 불러오기
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

%config InlineBackend.figure_format='retina'

1) 다음 파일을 읽어 **graduate**, **titanic** 데이터프레임을 만드세요.
- 'https://raw.githubusercontent.com/Jangrae/csv/master/Graduate_apply.csv'
- 'https://raw.githubusercontent.com/Jangrae/csv/master/titanic_simple.csv'

In [2]:
# graduate 데이터프레임 만들기
file_path = 'https://raw.githubusercontent.com/Jangrae/csv/master/Graduate_apply.csv'
graduate = pd.read_csv(file_path, sep = ',')

# 확인
graduate.head()

   admit  gre   gpa  rank
0      0  380  3.61     3
1      1  660  3.67     3
2      1  800  4.00     1
3      1  640  3.19     4
4      0  520  2.93     4

In [3]:
# titanic 데이터프레임 만들기
file_path = 'https://raw.githubusercontent.com/Jangrae/csv/master/titanic_simple.csv'
titanic = pd.read_csv(file_path, sep = ',')

# 확인
titanic.head()

   PassengerId  Survived  Pclass  ...   Age     Fare      Embarked
0            1         0       3  ...  22.0   7.2500  Southhampton
1            2         1       1  ...  38.0  71.2833     Cherbourg
2            3         1       3  ...  26.0   7.9250  Southhampton
3            4         1       1  ...  35.0  53.1000  Southhampton
4            5         0       3  ...  35.0   8.0500  Southhampton

[5 rows x 8 columns]

### graduate 데이터프레임 사용

1) unique() 메소드를 사용해 rank 열에 어떤 값들이 들어 있는 지 확인하세요.

In [4]:
# rank 값 확인
graduate['rank'].unique()

array([3, 1, 4, 2])

2) value_counts() 메소드를 사용해 rank 열에 어떤 값이 몇 개씩 있는지 확인하세요.

In [5]:
# rank 값 개수 확인
graduate['rank'].value_counts()

2    151
3    121
4     67
1     61
Name: rank, dtype: int64

3) gre 값이 평균 이상이면서 rank가 4인 행을 조회하세요.

In [6]:
# gre 값 평균
gre_mean = graduate['gre'].mean()

# gre 값이 gre 평균 이상이고 rank가 4인 사람
graduate[(graduate['gre'] >= gre_mean) & (graduate['rank'] == 4)]

     admit  gre   gpa  rank
3        1  640  3.19     4
10       0  800  4.00     4
16       0  780  3.87     4
22       0  600  2.82     4
23       0  680  3.19     4
52       0  740  3.37     4
59       0  600  2.82     4
66       0  740  3.62     4
74       0  720  3.45     4
80       0  700  2.90     4
96       0  640  3.52     4
110      0  680  3.08     4
127      0  740  3.74     4
141      1  700  3.52     4
142      0  620  3.94     4
210      0  740  3.34     4
250      0  660  3.31     4
251      0  620  3.21     4
254      1  740  3.52     4
278      1  680  3.00     4
282      0  660  3.45     4
285      0  600  3.31     4
287      1  660  3.70     4
288      0  800  3.15     4
317      1  780  3.63     4
337      0  620  3.09     4

4) 인덱스 값이 6 ~ 10 인 행을 조회하세요.

In [7]:
# 인덱스 이름 6 ~ 10 조회
graduate.loc[6:10]

    admit  gre   gpa  rank
6       1  560  2.98     1
7       0  400  3.08     2
8       1  540  3.39     3
9       0  700  3.92     2
10      0  800  4.00     4

5) 맨 뒤에서 5번째 행을 조회하세요.

In [8]:
# 뒤에서 5 번째 행
graduate.iloc[[-5]]

     admit  gre  gpa  rank
395      0  620  4.0     2

6) gre 열만 조회하세요.

In [9]:
# gre 열만 조회
graduate['gre']

0      380
1      660
2      800
3      640
4      520
      ...
395    620
396    560
397    460
398    700
399    600
Name: gre, Length: 400, dtype: int64

7) gre, gpa 열만을 갖는 새로운 데이터프레임 graduate2를 선언하고 확인하세요.

In [10]:
# graduate2 만들기
graduate2 = graduate[['gre', 'gpa']]

# 확인
graduate2

     gre   gpa
0    380  3.61
1    660  3.67
2    800  4.00
3    640  3.19
4    520  2.93
..   ...   ...
395  620  4.00
396  560  3.04
397  460  2.63
398  700  3.65
399  600  3.89

[400 rows x 2 columns]

## titanic 데이터프레임 사용

8) 15번째 행을 조회하세요.

In [11]:
# 15번째 행 조회
titanic.iloc[14]

PassengerId                                      15
Survived                                          0
Pclass                                            3
Name           Vestrom, Miss. Hulda Amanda Adolfina
Sex                                          female
Age                                              14
Fare                                         7.8542
Embarked                               Southhampton
Name: 14, dtype: object

9) PassengerId가 20인 행의 Name, Age 열만 조희하세요.

In [12]:
# PassengerId가 20인 Name, Age 열 조회
titanic.loc[titanic['PassengerId'] == 20, ['Name', 'Age']]

                       Name  Age
19  Masselmani, Mrs. Fatima  NaN

10) Age가 1 이하인 행을 조회하세요.

In [13]:
# Age가 1 이하인 행 조회
titanic[titanic['Age'] <= 1]

     PassengerId  Survived  Pclass  ...   Age      Fare      Embarked
78            79         1       2  ...  0.83   29.0000  Southhampton
164          165         0       3  ...  1.00   39.6875  Southhampton
172          173         1       3  ...  1.00   11.1333  Southhampton
183          184         1       2  ...  1.00   39.0000  Southhampton
305          306         1       1  ...  0.92  151.5500  Southhampton
381          382         1       3  ...  1.00   15.7417     Cherbourg
386          387         0       3  ...  1.00   46.9000  Southhampton
469          470         1       3  ...  0.75   19.2583     Cherbourg
644          645         1       3  ...  0.75   19.2583     Cherbourg
755          756         1       2  ...  0.67   14.5000  Southhampton
788          789         1       3  ...  1.00   20.5750  Southhampton
803          804         1       3  ...  0.42    8.5167     Cherbourg
827          828         1       2  ...  1.00   37.0042     Cherbourg
831          832         1       2  ...  0.83   18.7500  Southhampton

[14 rows x 8 columns]

11) 여자(Female)이면서, 탑승지역(Embarked)이 Southhampton 인 행을 조회하세요.

In [14]:
# 조건에 맞는 행 조회
titanic[(titanic['Sex'] == 'female') & (titanic['Embarked'] == 'Southhampton')]

     PassengerId  Survived  Pclass  ...   Age     Fare      Embarked
2              3         1       3  ...  26.0   7.9250  Southhampton
3              4         1       1  ...  35.0  53.1000  Southhampton
8              9         1       3  ...  27.0  11.1333  Southhampton
10            11         1       3  ...   4.0  16.7000  Southhampton
11            12         1       1  ...  58.0  26.5500  Southhampton
..           ...       ...     ...  ...   ...      ...           ...
871          872         1       1  ...  47.0  52.5542  Southhampton
880          881         1       2  ...  25.0  26.0000  Southhampton
882          883         0       3  ...  22.0  10.5167  Southhampton
887          888         1       1  ...  19.0  30.0000  Southhampton
888          889         0       3  ...   NaN  23.4500  Southhampton

[203 rows x 8 columns]

12) 11번 문제에서 조회한 탑승객의 평균 나이를 조회하세요.

In [15]:
# 조건에 맞는 행의 특정 열 평균 조회
titanic[(titanic['Sex'] == 'female') & (titanic['Embarked'] == 'Southhampton')]['Age'].mean()

27.771505376344088

13) Fare 열 값이 가장 큰 행을 모두 조회하세요.

In [16]:
# Fare 값이 가장 큰 행 조회
titanic[titanic['Fare'] == titanic['Fare'].max()]

     PassengerId  Survived  Pclass  ...   Age      Fare   Embarked
258          259         1       1  ...  35.0  512.3292  Cherbourg
679          680         1       1  ...  36.0  512.3292  Cherbourg
737          738         1       1  ...  35.0  512.3292  Cherbourg

[3 rows x 8 columns]

<center><img src='https://raw.githubusercontent.com/Jangrae/img/master/end.png' width=300/></center>